In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
tsl=pd.read_csv("TESLA.csv")

In [3]:
tsl.head()

,Unnamed: 0,Date,Open,High,Low,Close,Adj Close,Volume
0,0,6/29/10,1.266667,1.666667,1.169333,1.592667,1.592667,281494500
1,1,6/30/10,1.719333,2.028000,1.553333,1.588667,1.588667,257806500
2,2,7/1/10,1.666667,1.728000,1.351333,1.464000,1.464000,123282000
3,3,7/2/10,1.533333,1.540000,1.247333,1.280000,1.280000,77097000
4,4,7/6/10,1.333333,1.333333,1.055333,1.074000,1.074000,103003500

In [4]:
# Check if all values in 'Close' and 'Adj Close' are the same
comparison_result = (tsl['Close'] == tsl['Adj Close']).all()

# Print the result
if comparison_result:
    print("All values in 'Close' and 'Adj Close' are identical.")
else:
    print("There are differences between 'Close' and 'Adj Close' values.")

# Optionally: Show the rows where they are different (if any)
differences = tsl[tsl['Close'] != tsl['Adj Close']]
print(differences)

All values in 'Close' and 'Adj Close' are identical.
Empty DataFrame
Columns: [Unnamed: 0, Date, Open, High, Low, Close, Adj Close, Volume]
Index: []

In [5]:
tsl.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3637 entries, 0 to 3636
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  3637 non-null   int64
 1   Date        3637 non-null   object
 2   Open        3637 non-null   float64
 3   High        3637 non-null   float64
 4   Low         3637 non-null   float64
 5   Close       3637 non-null   float64
 6   Adj Close   3637 non-null   float64
 7   Volume      3637 non-null   int64
dtypes: float64(5), int64(2), object(1)
memory usage: 227.4+ KB

In [6]:
tsl.iloc[3635]

Unnamed: 0          3635
Date             12/6/24
Open          377.420013
High           389.48999
Low           370.799988
Close         389.220001
Adj Close     389.220001
Volume          81455800
Name: 3635, dtype: object

In [7]:
tsl1=pd.read_csv("HistoricalData_1726367135218.csv")
tsl1.head()

         Date Close/Last    Volume     Open     High        Low
0  09/13/2024    $230.29  59515110  $228.00  $232.67    $226.32
1  09/12/2024    $229.81  72020040  $224.66  $231.45    $223.83
2  09/11/2024    $228.13  83548630  $224.55  $228.47  $216.8003
3  09/10/2024    $226.17  78891140  $220.07  $226.40  $218.6377
4  09/09/2024    $216.27  67443520  $216.20  $219.87    $213.67

In [8]:
tsl1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        2517 non-null   object
 1   Close/Last  2517 non-null   object
 2   Volume      2517 non-null   int64
 3   Open        2517 non-null   object
 4   High        2517 non-null   object
 5   Low         2517 non-null   object
dtypes: int64(1), object(5)
memory usage: 118.1+ KB

In [9]:
tsl2=pd.read_csv("TSLA-2.csv")
tsl2.head()

         Date      Open      High       Low     Close  Adj Close     Volume
0  2010-06-29  1.266667  1.666667  1.169333  1.592667   1.592667  281494500
1  2010-06-30  1.719333  2.028000  1.553333  1.588667   1.588667  257806500
2  2010-07-01  1.666667  1.728000  1.351333  1.464000   1.464000  123282000
3  2010-07-02  1.533333  1.540000  1.247333  1.280000   1.280000   77097000
4  2010-07-06  1.333333  1.333333  1.055333  1.074000   1.074000  103003500

In [10]:
# Check if all values in 'Close' and 'Adj Close' are the same
comparison_result = (tsl2['Close'] == tsl2['Adj Close']).all()

# Print the result
if comparison_result:
    print("All values in 'Close' and 'Adj Close' are identical.")
else:
    print("There are differences between 'Close' and 'Adj Close' values.")

# Optionally: Show the rows where they are different (if any)
differences = tsl2[tsl2['Close'] != tsl2['Adj Close']]
print(differences)

All values in 'Close' and 'Adj Close' are identical.
Empty DataFrame
Columns: [Date, Open, High, Low, Close, Adj Close, Volume]
Index: []

In [11]:
tsl2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3562 entries, 0 to 3561
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       3562 non-null   object
 1   Open       3562 non-null   float64
 2   High       3562 non-null   float64
 3   Low        3562 non-null   float64
 4   Close      3562 non-null   float64
 5   Adj Close  3562 non-null   float64
 6   Volume     3562 non-null   int64
dtypes: float64(5), int64(1), object(1)
memory usage: 194.9+ KB

In [12]:
tsl3=pd.read_csv("tsla_2025.csv")
tsl3.head(10)

         Date     Open     High       Low    Close     Volume
0  2010-06-28  1.13333  1.13333  1.133330  1.13333          0
1  2010-06-29  1.26667  1.66667  1.169330  1.59267  281749140
2  2010-06-30  1.71933  2.02800  1.553330  1.58867  257915910
3  2010-07-01  1.66667  1.72800  1.351330  1.46400  123447945
4  2010-07-02  1.53333  1.54000  1.247330  1.28000   77127105
5  2010-07-06  1.33333  1.33333  1.055330  1.07400  103189440
6  2010-07-07  1.09333  1.10867  0.998667  1.05333  103873710
7  2010-07-08  1.07600  1.16800  1.038000  1.16400  115793085
8  2010-07-09  1.17200  1.19333  1.103330  1.16000   60879090
9  2010-07-12  1.19667  1.20467  1.133330  1.13667   33053550

In [13]:
tsl3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3663 entries, 0 to 3662
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    3663 non-null   object
 1   Open    3663 non-null   float64
 2   High    3663 non-null   float64
 3   Low     3663 non-null   float64
 4   Close   3663 non-null   float64
 5   Volume  3663 non-null   int64
dtypes: float64(4), int64(1), object(1)
memory usage: 171.8+ KB

In [14]:
tsl3.iloc[3635]

Date      2024-12-06
Open          377.42
High          389.49
Low            370.8
Close         389.22
Volume      81455834
Name: 3635, dtype: object

In [15]:
tsl3.iloc[3660]

Date      2025-01-15
Open           409.9
High           429.8
Low          405.661
Close         428.22
Volume      81375460
Name: 3660, dtype: object